trade_exp/src/Documents/РемонтИТехническоеОбслуживание/РемонтИТехническоеОбслуживание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f3f977b6-26c5-4a49-a553-f515d1d938bf">
  <name>РемонтИТехническоеОбслуживание</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="fe55ec5f-01e7-4cbc-b96a-2d43d50fb479">
    <name>Техника</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a86b6151-f908-4ff1-833c-751e9e736fb1">
    <name>ДатаВыходаИзСтроя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="21346543-7540-45d4-936e-069b94004c88">
    <name>ДатаВведенияВРаботу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4238f219-b52a-4801-9984-78f3f64fb003">
    <name>ПоказанияПробега</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="60a911e2-f419-414e-bdbf-89c651176987">
    <name>ВидРаботИТехническогоОбслуживания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b2deed09-12ec-4248-8cdb-281bd3f1af27">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f67fbfc-9a3d-47f1-affe-f4e1fcf20c99">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="74a98c6a-b7dd-4c58-b04d-ba2a74546cb6">
    <name>Завершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

trade_exp/src/InformationRegisters/ПараметрыТехники/ПараметрыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e1dd7a41-8f89-4890-bfd0-3f99b5f7c06d">
  <name>ПараметрыТехники</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="aae31d69-157f-4cf9-8b51-60cf483b7a9a">
    <name>Завершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3ee3c362-de50-494d-aace-930c27fada78">
    <name>ПоказанияПробега</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7e3244d1-3d89-4bce-b99b-9906731085c2">
    <name>Пробег</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="f09688b6-ceb3-4e4b-bbb8-294e4f1fc8c9">
    <name>ДатаСледующегоТО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="043084e9-c0f4-4ce7-a2df-13be07c1413e">
    <name>ДатаСледующейЗаменыШин</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="2c7bf3e4-e2ea-4723-8afe-dc48ece9a3e2">
    <name>Техника</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="5700ed32-4290-48f3-b912-d3a2fcd39744">
    <name>ВидРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/РемонтИТехническоеОбслуживание/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокЗаказовНаВнутреннееПотребление.Параметры.УстановитьЗначениеПараметра("ДокументОснование", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
//АСИНХ Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПредыдущиеДанные = ПолучитьПоказательПредыдущегоПробега();
	
	Если ЗначениеЗаполнено(ПредыдущиеДанные.ПоказанияПробега)
		И ПредыдущиеДанные.ПоказанияПробега > Объект.ПоказанияПробега
		И ПредыдущиеДанные.ДатаЗаписи < Объект.ДатаВыходаИзСтроя
	Тогда
		Отказ = Истина;
		Кнопки = Новый СписокЗначений();
		Кнопки.Добавить("Отмена");
		Кнопки.Добавить("Пробег сброшен");
		
		Заголовок1 = "Текущие показания пробега меньше введенных ранее";
		ТекстСообщения1 = "Нажмите ""Отмена"" чтобы установить корректную Дату выхода из строя или ввести новые показания пробега."
						+ Символы.ПС + Символы.ПС + "Если пробег был сброшен, то нажмите ""Пробег сброшен""";
		
		//РезультатВопроса1 = Ждать ВопросАсинх(ТекстСообщения1, Кнопки,,,Заголовок1);
		РезультатВопроса1 = Вопрос(ТекстСообщения1, Кнопки,,,Заголовок1);
		ОчиститьСообщения();
		
		Если РезультатВопроса1 = "Пробег сброшен" Тогда
			
			ИтоговыйПробег = ПредыдущиеДанные.Пробег + Объект.ПоказанияПробега;
			ТекстСообщения2 = "Последний зафиксированный пробег составляет " + ПредыдущиеДанные.Пробег 
							+ ". После сброса общий пробег будет равен " + ИтоговыйПробег
							+ "." + Символы.ПС + Символы.ПС + "Подтверждаете сброс пробега?";
			
			//РезультатВопроса2 = Ждать ВопросАсинх(ТекстСообщения2, РежимДиалогаВопрос.ДаНет);
			РезультатВопроса2 = Вопрос(ТекстСообщения2, РежимДиалогаВопрос.ДаНет);
			ОчиститьСообщения();
			
			Если РезультатВопроса2 = КодВозвратаДиалога.Да Тогда
				Отказ = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьПоказательПредыдущегоПробега()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПараметрыТехникиСрезПоследних.Период КАК ДатаЗаписи,
		|	ПараметрыТехникиСрезПоследних.ПоказанияПробега КАК ПоказанияПробега,
		|	ПараметрыТехникиСрезПоследних.Пробег КАК Пробег
		|ИЗ
		|	РегистрСведений.ПараметрыТехники.СрезПоследних(&КонецПериода, Техника = &Техника) КАК ПараметрыТехникиСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПоказанияПробега УБЫВ";
	
	КонецПериода = Объект.ДатаВыходаИзСтроя + (Объект.Дата - НачалоДня(Объект.Дата) - 1);
	Запрос.УстановитьПараметр("Техника", Объект.Техника);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Структура("ДатаЗаписи, ПоказанияПробега, Пробег");
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗавершенПриИзменении(Элемент)
	Если Объект.Завершен Тогда
		Объект.ДатаВведенияВРаботу = ТекущаяДата();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаВнутреннееПотребление(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекстВопроса = "Данные еще не записаны.
		|Выполнение действия ""Создать заявку"" возможно только после записи данных.";
		
		ПоказатьПредупреждение( , ТекстВопроса);
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДокументОснование", Объект.Ссылка);
	ОткрытьФорму("Документ.ЗаказНаВнутреннееПотребление.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ВидыТехники(Техника)
	
	возврат Техника.ВидНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура ВидРаботИТехническогоОбслуживанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=ложь;
	СтруктураПараметров=Новый Структура();
	СтруктураПараметров.Вставить("ВидТехники",ВидыТехники(Объект.Техника));
	Оповещение=Новый ОписаниеОповещения("ВыборВидРаботИТехническогоОбслуживанияЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВидыРаботИТехническогоОбслуживания.Форма.Док_ФормаВыбора",СтруктураПараметров,,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидРаботИТехническогоОбслуживанияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	если Результат<>НЕОПРЕДЕЛЕНО тогда
		Объект.ВидРаботИТехническогоОбслуживания=Результат;
	конецесли;	
КонецПроцедуры
